In [182]:
import pandas as pd

In [183]:
df2=pd.DataFrame({'Rollno':[1,2,3,4,5],'Age':[23,25,22,24,23],'Name':['Alice','Bob','Charlie','David','Eva'],'Gender':['f','m','m','m','F'],'Score':[85,78,92,70,88]})

In [184]:
df1=df2.head(3)

In [185]:
df1

   Rollno  Age     Name Gender  Score
0       1   23    Alice      f     85
1       2   25      Bob      m     78
2       3   22  Charlie      m     92

In [186]:
df3=df2[df2['Gender']=='f']

In [187]:
df3

   Rollno  Age   Name Gender  Score
0       1   23  Alice      f     85

In [188]:
df2['Score 1']=df2['Score']

In [189]:
df2['Score 2']=df2['Score']

In [190]:
df2

   Rollno  Age     Name Gender  Score  Score 1  Score 2
0       1   23    Alice      f     85       85       85
1       2   25      Bob      m     78       78       78
2       3   22  Charlie      m     92       92       92
3       4   24    David      m     70       70       70
4       5   23      Eva      F     88       88       88

In [191]:
df2['Age 1']=df2['Age']

In [192]:
df2

   Rollno  Age     Name Gender  Score  Score 1  Score 2  Age 1
0       1   23    Alice      f     85       85       85     23
1       2   25      Bob      m     78       78       78     25
2       3   22  Charlie      m     92       92       92     22
3       4   24    David      m     70       70       70     24
4       5   23      Eva      F     88       88       88     23

In [193]:
df2.drop('Age 1',axis=1)

   Rollno  Age     Name Gender  Score  Score 1  Score 2
0       1   23    Alice      f     85       85       85
1       2   25      Bob      m     78       78       78
2       3   22  Charlie      m     92       92       92
3       4   24    David      m     70       70       70
4       5   23      Eva      F     88       88       88

In [194]:
df2.drop('Score 1','Score 2',axis=1)

TypeError: DataFrame.drop() takes from 1 to 2 positional arguments but 3 positional arguments (and 1 keyword-only argument) were given

In [ ]:
df2.drop('Score 1',axis=1)

In [ ]:
df2.drop(columns=['Score 2','Score 1'],axis=1,inplace =True)

In [ ]:
df2

In [ ]:
df2[df2['Gender']=='f',['Score']>85]

In [ ]:
print(df2[(df2['Gender']=='f') & (df2['Score']>85)])

In [ ]:
print(df2[(df2['Gender']=='f') & (df2['Score']>85)])

In [ ]:
df2

In [ ]:
d=df2.query("'Gender==f'"&"'Age>22'")

In [ ]:
d

In [ ]:
df2=df2.sort_values('Score',ascending=False)

In [ ]:
df2

In [ ]:
df2

In [ ]:
def assign_grade(Score):
    if Score>=90:
        return 'A'
    elif Score>=80:
        return 'B'
    elif Score>=70:
        return 'C'
    elif Score<70:
        return 'D'

In [ ]:
df2['Grade']=df2['Score'].apply(assign_grade)

In [ ]:
print(df2)

In [ ]:
df2=pd.DataFrame({'Month':['Jan','Feb','Mar','Jan','Feb','Mar'],'Product':['A','A','A','B','B','B'],'Sales':[150,200,250,300,400,500]})

In [ ]:
total_sales_per_product = df2.groupby('Product')['Sales'].sum().reset_index()
total_sales_per_product.rename(columns={'Sales': 'Total_Sales'}, inplace=True)

In [ ]:
print(total_sales_per_product)

In [ ]:
idx=df2.groupby('Product')['Sales'].idxmax()

In [ ]:
highest_sales_month=df2.loc[idx]

In [ ]:
print(highest_sales_month[['Product', 'Month', 'Sales']])

In [ ]:
df2=df2.merge(total_sales_per_product, on='Product')
df2['Sales_Percentage']=(df2['Sales']/df2['Total_Sales'])*100

In [ ]:
df2

In [249]:
df5=pd.DataFrame({'Name':['John','Doe','Jane','Anna','Smith'],'Department':['HR','Finance',None,'IT','HR'],'Salary':[50000,60000,55000,None,58000]})

In [251]:
missing_values_count=df5.isnull().sum()

In [253]:
print(missing_values_count)

Name          0
Department    1
Salary        1
dtype: int64

In [255]:
department_mode=df5['Department'].mode()[0]
df5['Department'].fillna(department_mode, inplace=True)

C:\Users\HDC0422083\AppData\Local\Temp\ipykernel_10276\366872733.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df5['Department'].fillna(department_mode, inplace=True)

In [257]:
print(df5)

    Name Department   Salary
0   John         HR  50000.0
1    Doe    Finance  60000.0
2   Jane         HR  55000.0
3   Anna         IT      NaN
4  Smith         HR  58000.0

In [261]:
salary_mean=df5['Salary'].mean()
df5['Salary'].fillna(salary_mean, inplace=True)

C:\Users\HDC0422083\AppData\Local\Temp\ipykernel_10276\1753570443.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df5['Salary'].fillna(salary_mean, inplace=True)

In [263]:
print(df5)

    Name Department   Salary
0   John         HR  50000.0
1    Doe    Finance  60000.0
2   Jane         HR  55000.0
3   Anna         IT  55750.0
4  Smith         HR  58000.0

In [265]:
df5.dropna(inplace=True)

In [267]:
print(df5)

    Name Department   Salary
0   John         HR  50000.0
1    Doe    Finance  60000.0
2   Jane         HR  55000.0
3   Anna         IT  55750.0
4  Smith         HR  58000.0

In [271]:
temperature=pd.Series([23, 21, 20, 25, 27, 30, 28, 22, 24, 26])

In [273]:
mean=temperature.mean()
median=temperature.median()
std=temperature.std()

In [275]:
print(mean)

24.6

In [277]:
print(median)

24.5

In [279]:
print(std)

3.204163957519444

In [291]:
temp=(temperature - 32)*5/9

print(temp)

In [294]:
index_max = temperature.idxmax()
index_min = temperature.idxmin()

In [298]:
print(f"Index of max: {index_max}")

Index of max: 5

In [302]:
print(f"Index of min: {index_min}")

Index of min: 2

In [304]:
sort_ascen=temperature.sort_values()

In [306]:
sort_desce=temperature.sort_values(ascending=False)

In [308]:
print(sort_ascen)

2    20
1    21
7    22
0    23
8    24
3    25
9    26
4    27
6    28
5    30
dtype: int64

In [310]:
print(sort_desce)

5    30
6    28
4    27
9    26
3    25
8    24
0    23
7    22
1    21
2    20
dtype: int64

In [1]:
import pandas as pd

In [3]:
cust = pd.DataFrame({
    'CustomerID': [101, 102, 103, 104],
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Location': ['New York', 'Los Angeles', 'Chicago', 'Houston']
})

In [5]:
orders = pd.DataFrame({
    'OrderID': [1, 2, 3, 4, 5],
    'CustomerID': [101, 102, 101, 103, 104],
    'OrderAmount': [250, 150, 300, 200, 100]
})

In [7]:
merg=pd.merge(orders, cust,on='CustomerID')

In [9]:
print(merg)

   OrderID  CustomerID  OrderAmount     Name     Location
0        1         101          250    Alice     New York
1        2         102          150      Bob  Los Angeles
2        3         101          300    Alice     New York
3        4         103          200  Charlie      Chicago
4        5         104          100    David      Houston

In [ ]:
order_count=merg